# Cobbler 学习

* Cobbler 是通过将 DHCP、TFTP、DNS、HTTP 等服务进行集成，创建一个中央管理节点，其可以实现的功能有配置服务，创建存储库，解压缩操作系统媒介，代理或集成一个配置管理系统，控制电源管理等
* Cobbler 的最终目的是实现无需进行人工干预即可安装机器
* Cobbler 由 python 语言开发，是对 PXE 和 Kickstart 以及 DHCP 的封装。融合很多特性，提供了 CLI 和 Web 的管理形式。更加方便的实行网络安装。同时，Cobbler 也提供了 API 接口，使用其它语言也很容易做扩展。它不紧可以安装物理机，同时也支持 kvm、xen 虚拟化、Guest OS 的安装。更多的是它还能结合 Puppet 等集中化管理软件，实现自动化的管理。

## PXE

* PXE - Preboot eXecution Environment - 预启动执行环境、预执行环境
* 可以让计算机通过网卡独立地使用数据设备 ( 如硬盘 ) 或者安装操作系统

## kickstart

* Kickstart 是红帽搞出来的一个东西，我们可以简单理解为一个自动安装应答配置管理程序。通过读取这个配置文件，系统知道怎么去分区，要安装什么包，配什么IP，优化什么内核参数等等。其主要有以下部分组成：
* Kickstart 安装选项，包含语言的选择，防火墙，密码，网络，分区的设置等；
* %Pre 部分，安装前解析的脚本，通常用来生成特殊的ks配置，比如由一段程序决定磁盘分区等；
* %Package 部分，安装包的选择，可以是 @core 这样的group的形式，也可以是这样 vim-* 包的形式；
* %Post 部分，安装后执行的脚本，通常用来做系统的初始化设置。比如启动的服务，相关的设定等。
